In [1]:
import numpy as np
import pandas as pd

In [4]:
s=pd.Series([1,3,5, np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
dates=pd.date_range("20130101",periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  1.147039  0.572352 -0.555362 -2.255945
2013-01-02  0.068478 -1.075980 -0.152854  0.686582
2013-01-03 -0.904889 -0.486593  1.753624  1.407791
2013-01-04  0.992893  0.444022 -0.357448  0.870308
2013-01-05  0.150342  0.377959 -0.238361 -0.607586
2013-01-06  0.325609 -0.828761  1.251087  0.568914

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.to_numpy()

array([[ 1.14703859,  0.57235179, -0.55536155, -2.25594494],
       [ 0.06847797, -1.07597973, -0.15285367,  0.68658177],
       [-0.90488869, -0.48659327,  1.75362409,  1.40779101],
       [ 0.99289263,  0.4440216 , -0.35744813,  0.87030791],
       [ 0.1503417 ,  0.3779586 , -0.23836135, -0.60758605],
       [ 0.3256089 , -0.82876128,  1.25108724,  0.56891439]])

In [16]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.296579 -0.166167  0.283448  0.111677
std    0.738365  0.718787  0.966927  1.335514
min   -0.904889 -1.075980 -0.555362 -2.255945
25%    0.088944 -0.743219 -0.327676 -0.313461
50%    0.237975 -0.054317 -0.195608  0.627748
75%    0.826072  0.427506  0.900102  0.824376
max    1.147039  0.572352  1.753624  1.407791

In [17]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.147039    0.068478   -0.904889    0.992893    0.150342    0.325609
B    0.572352   -1.075980   -0.486593    0.444022    0.377959   -0.828761
C   -0.555362   -0.152854    1.753624   -0.357448   -0.238361    1.251087
D   -2.255945    0.686582    1.407791    0.870308   -0.607586    0.568914

In [20]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -2.255945 -0.555362  0.572352  1.147039
2013-01-02  0.686582 -0.152854 -1.075980  0.068478
2013-01-03  1.407791  1.753624 -0.486593 -0.904889
2013-01-04  0.870308 -0.357448  0.444022  0.992893
2013-01-05 -0.607586 -0.238361  0.377959  0.150342
2013-01-06  0.568914  1.251087 -0.828761  0.325609

In [21]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-02  0.068478 -1.075980 -0.152854  0.686582
2013-01-06  0.325609 -0.828761  1.251087  0.568914
2013-01-03 -0.904889 -0.486593  1.753624  1.407791
2013-01-05  0.150342  0.377959 -0.238361 -0.607586
2013-01-04  0.992893  0.444022 -0.357448  0.870308
2013-01-01  1.147039  0.572352 -0.555362 -2.255945

In [22]:
df.loc[dates[0]]

A    1.147039
B    0.572352
C   -0.555362
D   -2.255945
Name: 2013-01-01 00:00:00, dtype: float64

In [23]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  1.147039  0.572352
2013-01-02  0.068478 -1.075980
2013-01-03 -0.904889 -0.486593
2013-01-04  0.992893  0.444022
2013-01-05  0.150342  0.377959
2013-01-06  0.325609 -0.828761

In [28]:
df.loc["20130102":"20130103",["A","B"]]

                   A         B
2013-01-02  0.068478 -1.075980
2013-01-03 -0.904889 -0.486593

# Title : Groupby

In [30]:
df.groupby('A').agg({'B': ['min', 'max'], 'C': 'sum'})

                  B                   C
                min       max       sum
A
-0.904889 -0.486593 -0.486593  1.753624
 0.068478 -1.075980 -1.075980 -0.152854
 0.150342  0.377959  0.377959 -0.238361
 0.325609 -0.828761 -0.828761  1.251087
 0.992893  0.444022  0.444022 -0.357448
 1.147039  0.572352  0.572352 -0.555362